//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
////知识点1：二维数组的创建、初始化
////     注意：可省略行，但一定不能省略列
//int main()
//{
//	int arr1[3][4] = { { 1, 2, 3, 4 }, { 5, 6, 7, 8 }, { 9, 10, 11, 12 } };
//	int arr2[][4] = { { 1, 2, }, { 5, 6}, { 9 } };
//	int arr3[3][4] = { { 1, 2, }, { 5, 6 }};
//	return 0;
//}
//
////知识点2：二维数组的使用
////    注意：1、下标从0开始，
////         2、可将二维数组看作是几个一维数组 （行可以看做一维数组的个数）
//
////case：打印二维数组的元素
//int main()
//{
//	//创建一个数组
//	int arr2[][4] = { { 1, 2, }, { 5, 6 }, { 9 } };//意味着三行四列
//	//打印行数
//	int i = 0;
//	//打印一行的元素
//	for (i = 0; i < 3; i++)
//	{
//		//打印一行的元素
//		int j = 0;
//		for (j = 0; j < 4; j++)
//		{
//			printf("%d ", arr2[i][j]);
//		}
//		//打印完一行换行
//		printf("\n");
//	}
//	return 0;
//}
//
//
////知识点3：二维数组的存储
////    注意：1、二维数组在内存中也是连续存储的
////         2、 先行后列 依次打印
////case：打印二维数组的地址
//int main()
//{
//	//创建一个数组
//	int arr2[][4] = { { 1, 2, }, { 5, 6 }, { 9 } };//意味着三行四列
//	//打印行数
//	int i = 0;
//	//打印一行的元素
//	for (i = 0; i < 3; i++)
//	{
//		//打印一行的元素
//		int j = 0;
//		for (j = 0; j < 4; j++)
//		{
//			//打印完每个元素地址换行
//			printf("arr2[%d][%d] = %p \n", i,j,&arr2[i][j]);//打印地址使用%p，且&arr2[i][j]取地址符号
//		}
//	}
//	return 0;
//}


//给数组各元素依次赋值
#include <stdio.h>
int main()
{
	int arr[3][4] = { 0 };
	int i = 0;
	for (i = 0; i<3; i++)
	{
		int j = 0;
		for (j = 0; j<4; j++)
		{
			//i=0---j为0、1、2、3
			//i=1---j为0，1，2，3
			//i=2---j为0，1，2，3
			arr[i][j] = i * 4 + j;//12次循环
		}
	}
	//打印数组
	for (i = 0; i<3; i++)
	{
		int j = 0;
		for (j = 0; j<4; j++)
		{
			printf("%d ", arr[i][j]);
		}
		printf("\n");
	}
	printf("\n" );
	return 0;
}