#define _CRT_SECURE_NO_WARNINGS 1


//打印图案

//上半部分
//-------*-------第一行    1个*  14个-  
//------***------2         3     12
//-----*****-----3         5     10
//----*******----4         7     8
//---*********---5         9     6
//--***********--6         11    4 
//-*************-7         13    2
//***************8         15    0


//下半部分
//-*************-9         13    2
//--***********--10        11    4
//---*********---11        9     6
//----*******----12        7     8
//-----*****-----13        5     10
//------***------14        3     12
//-------*-------15        1     14


#include<stdio.h>
int main()
{
	int line = 0;
	int j = 0;
	int i = 0;
	printf("请输入行数:\n");
	scanf("%d",&line);


	//打印上半部分

	for(j=0; j<line; j++) //控制行的循环
	{
		//打印一行
		//打印-
		for(i=0; i<line-1-j; i++)//控制每行-的循环
		{
			printf(" ");
		}
		//打印*
		for(i=0; i<2*j+1; i++) //控制每行*的循环
		{
			printf("*");
		}
		printf("\n");
	}



	//打印下半部分

	for(j=0; j<line-1; j++)
	{
		for(i=0; i<j+1; i++)//j从0开始for(i=0; i<=j; i++)
		{
			printf(" ");
		}
		for(i=0; i<2*(line-1-j)-1; i++)
		{
			printf("*");
		}
		printf("\n");
	}



	return 0;
}