#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//打印整数二进制的奇数位和偶数位
//获取一个整数二进制序列中所有的偶数位和奇数位，分别打印出二进制序列

//分析：打印奇数序列 0-30
//     打印偶数序列 1-31
//00000000 00000000 00000000 00001101
//0 0 0 0  0 0 0 0  0 0 0 0  0 0 1 0 ---偶数
// 0 0 0 0  0 0 0 0  0 0 0 0  0 0 1 1 ---奇数
//00000000 00000000 00000000 00000001
//1&(num>>i)

int main()
{
	int num = 0;
	printf("请输入一个数：");
	scanf("%d", &num);
	//打印奇数序列
	int i = 0;
	for (i = 30; i >= 0; i -= 2)
	{
		printf("%d ", 1&(num>>i));
	}
	printf("\n");
	//打印偶数序列
	int j = 0;
	for (j = 31; j >= 1; j -= 2)
	{
		printf("%d ", 1&(num >> j));
	}
	printf("\n");
	return 0;
}

